Courses/4420/Lectures/BufferOverflow/ASLR/ASLR-WIP.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ASLR WIP TBD</title>
<!-- 2018-11-04 Sun 10:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">ASLR WIP TBD</h1>
<ol class="org-ol">
<li>"Address space layout randomization (ASLR) is a memory-protection
process for operating systems (OSes) that guards against
buffer-overflow attacks by randomizing the location where system
executables are loaded into memory."
</li>

<li>stack top as seen from main() is randomized.
</li>

<li>Several mainstream, general-purpose operating systems implement
ASLR.  Android, BSDs, Linux, iOS, Windows.
</li>

<li>"A side-channel attack utilizing branch target buffer was
demonstrated to bypass ASLR protection.  In 2017, an attack named
"ASLR ⊕ Cache" was demonstrated which could defeat ASLR in a web
browser using JavaScript.
</li>

<li>Understand /boot/abi-4.18.0-8-generic TBD
</li>
</ol>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Slides</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="http://security.cs.rpi.edu/courses/binexp-spring2015/lectures/15/09_lecture.pdf">http://security.cs.rpi.edu/courses/binexp-spring2015/lectures/15/09_lecture.pdf</a>
65+ slides.  Modern Binary Exploitation CSCI 4968 RPI.edu Spring
2015 Patrick Biernat
</li>

<li><a href="http://www.cs.ucr.edu/~csong/seclab/17/l/lab06-aslr/slides.pdf">http://www.cs.ucr.edu/~csong/seclab/17/l/lab06-aslr/slides.pdf</a>
   Chengyu Song; 20 Slides based on CS6265 taught by Prof. Taesoo Kim
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Labs</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://ocw.cs.pub.ro/courses/cns/labs/lab-10">https://ocw.cs.pub.ro/courses/cns/labs/lab-10</a> Lab 10 - Return Oriented Programming
</li>

<li><a href="https://ocw.cs.pub.ro/courses/cns/labs/start">https://ocw.cs.pub.ro/courses/cns/labs/start</a> Labs for the Computer and Network Security class.
</li>
</ol>
<p>
Lab 01 - Introduction. Basic Exploration Tools
Lab 02 - Assembly Language
Lab 03 - Executables. Static Analysis
Lab 04 - Processes. Dynamic Analysis
Lab 05 - The Stack. Buffer Management
Lab 06 - Exploiting. Shellcodes
Lab 07 - Exploiting. Shellcodes (Part 2)
Lab 08 - Exploit Protection Mechanisms
Lab 09 - Strings
Lab 10 - Return Oriented Programming
Lab 11 - Return Oriented Programming (Part 2)
Lab 12 - Integers
Lab 13 - Advanced Binary Analysis
</p>

<ol class="org-ol">
<li><a href="http://www.cs.ucr.edu/~nael/pubs/micro16.pdf">http://www.cs.ucr.edu/~nael/pubs/micro16.pdf</a>
</li>
</ol>
<p>
Jump Over ASLR:
Attacking Branch Predictors to Bypass ASLR
Dmitry Evtyushkin
Department of Computer Science
State University of New York
at Binghamton
devtyushkin@cs.binghamton.edu
Dmitry Ponomarev
Department of Computer Science
State University of New York
at Binghamton
dima@cs.binghamton.edu
Nael Abu-Ghazaleh
Computer Science and
Engineering Department
University of California, Riverside
naelag@ucr.edu
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://en.wikipedia.org/wiki/Address_space_layout_randomization">https://en.wikipedia.org/wiki/Address_space_layout_randomization</a>
   Required Reading
</li>

<li>Brad Spengler (October 2003). "PaX: The Guaranteed End of Arbitrary
Code Execution". grsecurity.net. Slides 22 through 35.
</li>

<li>Daniel Gruss Clémentine Maurice Anders Fogh Moritz Lipp Stefan
Mangard Prefetch Side-Channel Attacks: Bypassing SMAP and Kernel
ASLR, CCS’16,  2016, Vienna, Austria.
</li>

<li>Hector Marco-Gisbert, and Ismael Ripoll-Ripoll, return-to-csu: A
New Method to Bypass 64-bit Linux ASLR, <a href="https://www.blackhat.com/docs/asia-18/asia-18-Marco-return-to-csu-a-new-method-to-bypass-the-64-bit-Linux-ASLR-wp.pdf">blackhat.com asia-18 PDF</a>
</li>

<li><a href="https://cs.unc.edu/~fabian/papers/oakland2013.pdf">https://cs.unc.edu/~fabian/papers/oakland2013.pdf</a> Just-In-Time Code Reuse:
</li>
</ol>
<p>
On the Effectiveness of Fine-Grained Address Space Layout Randomization
Kevin Z. Snow, Fabian Monrose
Department of Computer Science
University of North Carolina at Chapel Hill, USA
Email: {kzsnow,fabian}@cs.unc.edu
Lucas Davi, Alexandra Dmitrienko,
Christopher Liebchen, Ahmad-Reza Sadeghi
CASED/Technische Universitat Darmstadt, Germany
2013 IEEE Symposium on Security and Privacy
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-09-29
</div>
</body>
</html>
